# WhileLoadingFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..WhileLoadingFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
While loading family '[Family Name]': [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WhileLoadingFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WhileLoadingFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WhileLoadingFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace